stress-tests/artillery-test.yml
config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:5000' }}"
  phases:
    - name: Warm-up
      duration: 30
      arrivalRate: 5
    - name: Ramp-up
      duration: 60
      arrivalRate: 5
      rampTo: 50
    - name: Sustained load
      duration: 120
      arrivalRate: 50
    - name: Peak stress
      duration: 60
      arrivalRate: 100
    - name: Cool-down
      duration: 30
      arrivalRate: 50
      rampTo: 5
  defaults:
    headers:
      Content-Type: application/json
  ensure:
    thresholds:
      - http.response_time.p95: 1500
      - http.response_time.p99: 3000
      - http.codes.200: 95

scenarios:
  - name: Health check
    weight: 10
    flow:
      - get:
          url: /api/health
          expect:
            - statusCode: 200

  - name: Login + list files
    weight: 50
    flow:
      - post:
          url: /api/auth/login
          json:
            email: test@example.com
            password: password123
          capture:
            - json: $.token
              as: authToken
          expect:
            - statusCode: 200
      - get:
          url: /api/files
          headers:
            x-auth-token: "{{ authToken }}"
          expect:
            - statusCode: 200
      - get:
          url: /api/folders
          headers:
            x-auth-token: "{{ authToken }}"
          expect:
            - statusCode: 200

  - name: User registration
    weight: 20
    flow:
      - function: "generateRandomEmail"
      - post:
          url: /api/auth/register
          json:
            fullName: "Artillery User"
            email: "{{ email }}"
            password: "artilleryPass123"
          expect:
            - statusCode: 201

  - name: Full auth + profile read
    weight: 20
    flow:
      - post:
          url: /api/auth/login
          json:
            email: test@example.com
            password: password123
          capture:
            - json: $.token
              as: authToken
      - get:
          url: /api/auth/me
          headers:
            x-auth-token: "{{ authToken }}"
          expect:
            - statusCode: 200